Author: [Jose Guzman](https://github.com/jg2012)

Repo: [Github Link](https://github.com/jg2012/datafun-04-notebooks)

## Task 1 Create DataFrame

In [2]:
import pandas as pd

grades_dict = {'Wally': [97,96,80], 'Eva':[100, 86, 90], 'Sam': [94, 83, 85], 'Katie': [93, 92, 83], 'Bob': [98, 99, 100]}

grades = pd.DataFrame(grades_dict)

grades

   Wally  Eva  Sam  Katie  Bob
0     97  100   94     93   98
1     96   86   83     92   99
2     80   90   85     83  100

## Task 2 Custome Index

In [7]:
grades.index = ['Test1', 'Test2', 'Test3']

grades

       Wally  Eva  Sam  Katie  Bob
Test1     97  100   94     93   98
Test2     96   86   83     92   99
Test3     80   90   85     83  100

In [8]:

grades['Eva']

Test1    100
Test2     86
Test3     90
Name: Eva, dtype: int64

In [9]:
grades.Sam

Test1    94
Test2    83
Test3    85
Name: Sam, dtype: int64

## Task 3 Accessing Rows[loc, iloc]

In [6]:
grades.loc['Test1']

Wally     97
Eva      100
Sam       94
Katie     93
Bob       98
Name: Test1, dtype: int64

In [10]:
grades.iloc[0:2]

       Wally  Eva  Sam  Katie  Bob
Test1     97  100   94     93   98
Test2     96   86   83     92   99

In [11]:
grades.loc[['Test1', 'Test2']]

       Wally  Eva  Sam  Katie  Bob
Test1     97  100   94     93   98
Test2     96   86   83     92   99

In [12]:
grades.loc['Test1': 'Test2', ['Eva', 'Katie']]

       Eva  Katie
Test1  100     93
Test2   86     92

## Task 3 Accessing Subsets (at, iat)

In [14]:
grades.at['Test2', 'Eva']

86

In [15]:
grades.iat[2,0]

80

## Task  4 Describe (By Column)

In [16]:
grades.describe()

           Wally         Eva        Sam      Katie    Bob
count   3.000000    3.000000   3.000000   3.000000    3.0
mean   91.000000   92.000000  87.333333  89.333333   99.0
std     9.539392    7.211103   5.859465   5.507571    1.0
min    80.000000   86.000000  83.000000  83.000000   98.0
25%    88.000000   88.000000  84.000000  87.500000   98.5
50%    96.000000   90.000000  85.000000  92.000000   99.0
75%    96.500000   95.000000  89.500000  92.500000   99.5
max    97.000000  100.000000  94.000000  93.000000  100.0

In [22]:
pd.set_option("display.precision", 2)
grades.describe()

       Wally     Eva    Sam  Katie    Bob
count   3.00    3.00   3.00   3.00    3.0
mean   91.00   92.00  87.33  89.33   99.0
std     9.54    7.21   5.86   5.51    1.0
min    80.00   86.00  83.00  83.00   98.0
25%    88.00   88.00  84.00  87.50   98.5
50%    96.00   90.00  85.00  92.00   99.0
75%    96.50   95.00  89.50  92.50   99.5
max    97.00  100.00  94.00  93.00  100.0

## Task 5 Transpose (rows <---> columns)

In [25]:
grades.T.mean()

Test1    96.4
Test2    91.2
Test3    87.6
dtype: float64

In [24]:
grades.T.describe()

        Test1  Test2   Test3
count    5.00   5.00    5.00
mean    96.40  91.20   87.60
std      2.88   6.69    7.83
min     93.00  83.00   80.00
25%     94.00  86.00   83.00
50%     97.00  92.00   85.00
75%     98.00  96.00   90.00
max    100.00  99.00  100.00

## Task 6. Sort

In [26]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     80   90   85     83  100
Test2     96   86   83     92   99
Test1     97  100   94     93   98

In [27]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   98  100     93   94     97
Test2   99   86     92   83     96
Test3  100   90     83   85     80